{
    "3d-графика": "Раздел компьютерной графики, посвящённый методам создания изображений или видео путём моделирования объектов в трёх измерениях.",
    "браузер": "Прикладное ПО для просмотра страниц, содержания веб-документов, компьютерных файлов и их каталогов; управления веб-приложениями; а также для решения других задач.",
    "буферы": "Области памяти WebGL, в которых хранятся данные.",
    "кроссплатформенность": "Способность ПО работать с несколькими аппаратными платформами или операционными системами.",
    "по": "Совокупность всех программ и соответствующей документации, обеспечивающая использование ЭВМ в интересах каждого ее пользователя",
    "рендеринг": "Процесс генерации изображения из модели с использованием компьютерных программ.",
    "фреймворк": "Программная платформа, определяющая структуру программной системы; программное обеспечение, облегчающее разработку и объединение разных компонентов большого программного проекта.",
    "шейдер": "Компьютерная программа, предназначенная для исполнения процессорами видеокарты. Шейдеры составляются на одном из специализированных языков программирования и компилируются в инструкции для ЦП.",
    "api": "Интерфейс взаимодействия между сайтом и сторонними программами и серверами.",
    "canvas": "Элемент HTML5, предназначенный для создания растрового двухмерного изображения при помощи скриптов, обычно на языке JavaScript.",
    "gpu": "Однокристальный процессор с интегрированным преобразованием, освещением, настройкой / отсечкой треугольников и механизмами рендеринга, способный обрабатывать не менее 10 миллионов полигонов в секунду.",
    "html": "Стандартизированный язык разметки документов во Всемирной паутине. Большинство веб-страниц содержат описание разметки на языке HTML. Язык HTML интерпретируется браузерами; полученный в результате интерпретации форматированный текст отображается на экране монитора компьютера или мобильного устройства.",
    "javascript": "Мультипарадигменный язык программирования. Поддерживает объектно-ориентированный, императивный и функциональный стили. Обычно используется как встраиваемый язык для программного доступа к объектам приложений.",
    "opengl": "Спецификация, определяющая платформонезависимый программный интерфейс для написания приложений, использующих двумерную и трёхмерную компьютерную графику.",
    "svg": "Язык разметки масштабируемой векторной графики, предназначен для описания двумерной векторной и смешанной векторно/растровой графики.",
    "three.js": "Легковесная кроссбраузерная библиотека JavaScript, используемая для создания и отображения анимированной компьютерной 3D графики при разработке веб-приложений. Three.js скрипты могут использоваться совместно с элементом HTML5 CANVAS, SVG или WebGL.",
    "vr": "Созданный техническими средствами мир, передаваемый человеку через его ощущения: зрение, слух, осязание и другие. Виртуальная реальность имитирует как воздействие, так и реакции на воздействие.",
    "webgl": "Кроссплатформенный API для3D-графики в браузере, разрабатываемый некоммерческой организацией Khronos Group.",
    "webvr": "Браузерный API для доступа к устройствам виртуальной реальности."
}
